### 결측열 삭제

In [1]:
import pandas as pd

In [2]:
path= 'data1.csv'

In [3]:
df = pd.read_csv(path,encoding='cp949')

In [4]:
df.head()

      학번    이름   국어  영어  수학  결측1과목  결측과목2
0  30101  최군1   100  10  50    NaN    NaN
1  30102   최군2   90  20  70    NaN    NaN
2  30103   최군3   80  30  50    NaN    5.0
3  30104   최군4   70  40  70    5.0    NaN
4  30105   최군5   60  50  50    NaN    NaN

In [5]:
df.shape

(10, 7)

In [6]:
null_count = df.isnull().sum()

In [7]:
df_null_count = null_count.reset_index()

In [8]:
df_null_count.columns=['메뉴','결측']

In [9]:
df_null_count_3 = df_null_count.sort_values(by='결측',ascending=False).head(3)

In [10]:
drop_columns = df_null_count_3['메뉴']

In [11]:
drop_columns.to_list()

['결측1과목', '결측과목2', '학번']

In [12]:
df[drop_columns]

   결측1과목  결측과목2     학번
0    NaN    NaN  30101
1    NaN    NaN  30102
2    NaN    5.0  30103
3    5.0    NaN  30104
4    NaN    NaN  30105
5    NaN    NaN  30106
6   10.0    NaN  30107
7    NaN    NaN  30108
8    NaN    NaN  30109
9    NaN  100.0  30110

In [13]:
print(df.shape)

(10, 7)

In [14]:
df = df.drop(drop_columns, axis=1)

In [15]:
print(df.shape)

(10, 4)

In [16]:
df.head()

     이름   국어  영어  수학
0  최군1   100  10  50
1   최군2   90  20  70
2   최군3   80  30  50
3   최군4   70  40  70
4   최군5   60  50  50

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
이름    10 non-null object
국어    10 non-null int64
영어    10 non-null int64
수학    10 non-null int64
dtypes: int64(3), object(1)
memory usage: 448.0+ bytes